# Ruby
brew "rbenv"
brew "ruby-build"

# Node
# brew "nvm"
brew "nodenv"

# Shell Essentials
brew "fzf"
brew "starship"
brew "htop"

# AWS
brew "awscli"
brew "aws-vault"

# Terraform
tap "warrensbox/tap"
brew "tfswitch"
brew "tflint"

# Essential Apps
mas "1Password", id: 443987910

cask "visual-studio-code"
cask "iterm2"
cask "authy"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "spotify"
cask "licecap"
cask "slack"
cask "zoom"
cask "discord"
cask "rectangle"
cask "signal"
